In [3]:
import pandas as pd
#pd.Series(값 목록 , [인덱스])

s = pd.Series([5,10,15,20])
s
print(s)
# 시리즈 생성시 인덱스를 따로 설정하지 않으면
# 자동으로 생성된다

0     5
1    10
2    15
3    20
dtype: int64

In [3]:
s = pd.Series([2,4,6,8])
s
print(s)

0    2
1    4
2    6
3    8
dtype: int64

In [4]:
import pandas as pd
test = pd.Series([70,80,90] , index = ['국어','영어','수학'])
print(test)

국어    70
영어    80
수학    90
dtype: int64

In [9]:
test.loc['국어']

np.int64(70)

In [8]:
test['수학'] = 75
print(test)

국어    70
영어    80
수학    75
dtype: int64

In [11]:
s = pd.Series([15,27,18], index = ['봄','여름','가을'])
s
print(s)

봄     15
여름    27
가을    18
dtype: int64

In [12]:
s.loc['봄']

np.int64(15)

In [13]:
s.loc['가을'] = 20

In [14]:
print(s)

봄     15
여름    27
가을    20
dtype: int64

In [15]:
s = pd.Series([1000,1200,1300], index = ['01-01','01-02','01-03'])
s
print(s)

01-01    1000
01-02    1200
01-03    1300
dtype: int64

In [17]:
s.loc['01-01']

np.int64(1000)

In [21]:
s.loc['01-02'] = 1250
print(s)

01-01    1000
01-02    1250
01-03    1300
dtype: int64

In [22]:
s = pd.Series([300,400,500], index = ['월','화','수'])
s
print(s)

월    300
화    400
수    500
dtype: int64

In [23]:
s.loc['화']

np.int64(400)

In [24]:
s.loc['수'] = 550

print(s)

월    300
화    400
수    550
dtype: int64

In [30]:
data = { " name " : ["철수","영희","민수"],
       "math" : [85,90,78]}
df = pd.DataFrame(data)
df

   name   math
0     철수    85
1     영희    90
2     민수    78

In [32]:
data = { " day " : ["월","화","수"],
       "sales" : [1000,1200,900]}
df = pd.DataFrame(data)
df

   day   sales
0     월   1000
1     화   1200
2     수    900

In [37]:
import numpy as np
data = np.array([[30,10],[40,20]])
df = pd.DataFrame(data,
                  index = ['사과','배'],
                  columns = ['판매량' , '재고'])
df

    판매량  재고
사과   30  10
배    40  20

In [43]:
df.loc['사과','판매량']

np.int64(30)

In [42]:
df['가격'] = [1000,1200]
df

    판매량  재고    가격
사과   30  10  1000
배    40  20  1200

In [49]:
import numpy as np
data = np.array([[1950,1200],[500,800]])
df = pd.DataFrame(data,
                  index = ['서울','부산'],
                    columns = ['인구','면적'])
df

      인구    면적
서울  1950  1200
부산   500   800

In [50]:
df.loc['서울','면적']

np.int64(1200)

In [51]:
df['특산물'] = ['김치','어묵']
df

      인구    면적 특산물
서울  1950  1200  김치
부산   500   800  어묵

In [63]:
import numpy as np
data = np.array ([[15000,'홍길동전'],[20000,'해리포터']])
df = pd.DataFrame(data,
                  index = ['책1','책2'],
                  columns = [ '가격','제목'])
df

       가격    제목
책1  15000  홍길동전
책2  20000  해리포터

In [64]:
df.loc['책2','가격']

'20000'

In [65]:
df.insert(1,'저자',['허균','J.K롤링'])
df

       가격     저자    제목
책1  15000     허균  홍길동전
책2  20000  J.K롤링  해리포터

In [76]:
import numpy as np
data = np.array ([[9.0,14000],[8.2,9500]])
df = pd.DataFrame(data,
                  index = ['기생충','인터스텔라'],
                  columns = ['평점','관객수'])
df

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [77]:
df.loc['기생충','평점']

np.float64(9.0)

In [80]:
# del df ['관객수']
df

result = df.drop('관객수',axis=1)
print(result)
df

        평점
기생충    9.0
인터스텔라  8.2

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [86]:
s = pd.Series([80,90,75,85],index = ['국어','영어','수학','과학'])
s

국어    80
영어    90
수학    75
과학    85
dtype: int64

In [91]:
print('총점:',sum(s))

총점: 330

In [106]:
print('평균:',s .mean())

평균: 2.0

In [98]:
print('최고점수:',max(s))

최고점수: 90

In [99]:
print('최저점수:',min(s))

최저점수: 75

In [102]:
s= pd.Series([2,5,-1,0,7,-3,4], index = ['월','화','수','목','금','토','일'])
s

월    2
화    5
수   -1
목    0
금    7
토   -3
일    4
dtype: int64

In [103]:
s[s>0]

월    2
화    5
금    7
일    4
dtype: int64

In [110]:
data = np.array([[12000,9.0],[8000,8.5],[15000,9.3]])
df = pd.DataFrame(data,
                  index = ['기생충' , '인터스텔라','아바타'],
                  columns = ['관객수','평점'])
df

           관객수   평점
기생충    12000.0  9.0
인터스텔라   8000.0  8.5
아바타    15000.0  9.3

In [112]:
df['관객수'] + 1000
df

           관객수   평점
기생충    12000.0  9.0
인터스텔라   8000.0  8.5
아바타    15000.0  9.3

SyntaxError: incomplete input (3843813759.py, line 1)

In [127]:
data = np.array([[25000,30000],[40000,15000]])
df = pd.DataFrame(data,
                  index = ['치마' , '바지'],
                  columns = ['1월 매출','2월 매출'])
df

    1월 매출  2월 매출
치마  25000  30000
바지  40000  15000

In [140]:
# 1월 매출
print(df['1월 매출'])
# 2월 매출
print(df['2월 매출'])
# 시리즈끼리 더하면, 인덱스 기준으로 합계가 나옴
df['1월 매출']+df['2월 매출']
# 새로운 열추가
df['합계'] = df['1월 매출']+df['2월 매출']
df

치마    25000
바지    40000
Name: 1월 매출, dtype: int64
치마    30000
바지    15000
Name: 2월 매출, dtype: int64

    1월 매출  2월 매출     합계
치마  25000  30000  55000
바지  40000  15000  55000

In [144]:
df['합계(만원)'] = df['합계']/10000
df

    1월 매출  2월 매출     합계  합계(만원)
치마  25000  30000  55000     5.5
바지  40000  15000  55000     5.5

In [160]:
#성적 데이터 
data = np.array ([[80,75,90],[85,88,82],[70,65,78]])
df = pd.DataFrame(data,
                        index = ['국어','영어','수학'],
                        columns = ['1반','2반','3반'])
df

    1반  2반  3반
국어  80  75  90
영어  85  88  82
수학  70  65  78

In [161]:
df.loc['영어','2반'] = np.nan
df

    1반    2반  3반
국어  80  75.0  90
영어  85   NaN  82
수학  70  65.0  78

In [162]:
df=df.dropna(axis=1)
df

    1반  3반
국어  80  90
영어  85  82
수학  70  78

In [5]:
s = pd.Series (['서울','부산','서울','부산','서울'])
s

0    서울
1    부산
2    서울
3    부산
4    서울
dtype: object

In [6]:
s.unique()

array(['서울', '부산'], dtype=object)

In [8]:
s = pd.Series(['민수','지연','철수','민수','영희','민수','지연'])
s

0    민수
1    지연
2    철수
3    민수
4    영희
5    민수
6    지연
dtype: object

In [9]:
s.value_counts()

민수    3
지연    2
철수    1
영희    1
Name: count, dtype: int64

In [11]:
result = s.value_counts()
result.max()

3